reddit_clone/app/views/posts/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
---
    <ul>
    <% comment.child_comments.each do |child| %>