reddit_clone/app/models/post.rb

  def comments_by_parent_id
    h = Hash.new { |h,k| h[k] = [] }

    self.comments.each do |c|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]