reddit_clone/app/models/user.rb

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "G0u4DpzMJOQxIu03TD0L7A"], ["updated_at", "2019-04-09 19:15:03.574961"], ["id", 1]]