reddit_clone/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        @comment.parent_comment_id = params[:comment][:parent_comment_id]
        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "a new comment to a comment.."], ["author_id", 2], ["post_id", 8], ["created_at", "2019-04-09 22:37:55.692155"], ["updated_at", "2019-04-09 22:37:55.692155"], ["parent_comment_id", 4]]