reddit_clone/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs" WHERE 1=0
---
  def new
    @subs = Sub.all