reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 7], ["sub_id", 1], ["created_at", "2019-04-09 21:46:54.682281"], ["updated_at", "2019-04-09 21:46:54.682281"]]
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdf"], ["url", "askldf"], ["content", "ajksl;df"], ["author_id", 2], ["created_at", "2019-04-09 21:08:20.237934"], ["updated_at", "2019-04-09 21:08:20.237934"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id] #need to add hidden input
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "edited"], ["updated_at", "2019-04-09 21:52:58.426394"], ["id", 8]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def require_author
    @post = Post.find(params[:id])